input/pagecontent/volume-1.md
```mermaid
sequenceDiagram
    participant Client
    participant Server
    activate Client
    activate Server
    Client ->> Server: 1. Go Query Domain-YY
    Server -->> Client: 2. Go Response Domain-YY
    deactivate Server
    deactivate Client
    activate Client
    Client ->> Client: process response
    deactivate Client
```
